tap "cloudfoundry/tap"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "haiperspace/hai", "https://github.tools.sap/hAIperspace/hai-homebrew"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sap/sapmachine"
brew "sqlite"
brew "awscli"
brew "bat"
brew "gettext"
brew "cmake"
brew "coreutils"
brew "devspace"
brew "dos2unix"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "gofumpt"
brew "graphviz"
brew "helm"
brew "hey"
brew "htop"
brew "iproute2mac"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "n"
brew "neovim"
brew "netcat"
brew "ollama"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "telnet"
brew "tmux"
brew "tree"
brew "wget"
brew "wireshark"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "cloudfoundry/tap/cf-cli@8"
brew "derailed/k9s/k9s"
brew "felixkratz/formulae/borders"
brew "haiperspace/hai/hai"
brew "hashicorp/tap/terraform"
brew "qmk/qmk/qmk"
cask "1password"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "arc"
cask "balenaetcher"
cask "beyond-compare@4"
cask "bruno"
cask "claude"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "drawio"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "homerow"
cask "insomnia"
cask "jordanbaird-ice"
cask "kicad"
cask "lookaway"
cask "maccy"
cask "microsoft-edge"
cask "ngrok/ngrok/ngrok"
cask "obsidian"
cask "raspberry-pi-imager"
cask "raycast"
cask "sap/sapmachine/sapmachine17-jdk"
cask "sap/sapmachine/sapmachine21-jdk"
cask "sap/sapmachine/sapmachine23-jdk", args: { appdir: "/Applications" }
cask "slack"
cask "spotify"
cask "todoist-app"
cask "tomatobar"
cask "visual-studio-code"
cask "wireshark-app"
vscode "alexcvzz.vscode-sqlite"
vscode "alexkrechik.cucumberautocomplete"
vscode "andys8.jest-snippets"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bruno-api-client.bruno"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.colab"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jebbs.plantuml"
vscode "jhodel.blue-phoenix"
vscode "llam4u.nerdtree"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "sapos.yeoman-ui"
vscode "saposs.app-studio-remote-access"
vscode "saposs.app-studio-toolkit"
vscode "saposs.sap-hana-driver-for-sqltools"
vscode "sapse.sapdas-extension"
vscode "sapse.vsc-hana-supportability"
vscode "sonarsource.sonarlint-vscode"
vscode "spadin.zmk-tools"
vscode "tamasfe.even-better-toml"
vscode "tobias-z.vscode-harpoon"
vscode "tompollak.lazygit-vscode"
vscode "tomrijndorp.find-it-faster"
vscode "tyriar.sort-lines"
vscode "undotree.undo-tree"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-manifest-yaml"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "zhuangtongfa.material-theme"
go "github.com/go-delve/delve/cmd/dlv"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/gopls"
go "github.com/jesseduffield/lazygit"
go "honnef.co/go/tools/cmd/staticcheck"
uv "qmk", with: ["pip"]
