tap "cloudfoundry/tap"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sap/sapmachine"
brew "bat"
brew "gettext"
brew "cmake"
brew "coreutils"
brew "devspace"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "gofumpt"
brew "graphviz"
brew "htop"
brew "iproute2mac"
brew "lazygit"
brew "mise"
brew "n"
brew "neovim"
brew "netcat"
brew "nvm"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "telnet"
brew "tmux"
brew "tree"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "cloudfoundry/tap/cf-cli@8"
brew "derailed/k9s/k9s"
brew "qmk/qmk/qmk"
cask "1password"
cask "aerospace"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "arc"
cask "autodesk-fusion"
cask "beyond-compare"
cask "bruno"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "drawio"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "homerow"
cask "insomnia"
cask "jordanbaird-ice"
cask "kicad"
cask "lookaway"
cask "maccy"
cask "microsoft-edge"
cask "obsidian"
cask "raspberry-pi-imager"
cask "raycast"
cask "sapmachine17-jdk"
cask "sapmachine21-jdk"
cask "sapmachine23-jdk", args: { appdir: "/Applications" }
cask "spotify"
cask "todoist-app"
cask "tomatobar"
cask "visual-studio-code"
vscode "alexcvzz.vscode-sqlite"
vscode "alexkrechik.cucumberautocomplete"
vscode "andys8.jest-snippets"
vscode "angular.ng-template"
vscode "asvetliakov.vscode-neovim"
vscode "bruno-api-client.bruno"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jebbs.plantuml"
vscode "jhodel.blue-phoenix"
vscode "llam4u.nerdtree"
vscode "mechatroner.rainbow-csv"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "sapos.yeoman-ui"
vscode "saposs.app-studio-remote-access"
vscode "saposs.app-studio-toolkit"
vscode "sapse.sapdas-extension"
vscode "shardulm94.trailing-spaces"
vscode "sonarsource.sonarlint-vscode"
vscode "spadin.zmk-tools"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tobias-z.vscode-harpoon"
vscode "tompollak.lazygit-vscode"
vscode "tomrijndorp.find-it-faster"
vscode "tyriar.sort-lines"
vscode "undotree.undo-tree"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-manifest-yaml"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "zhuangtongfa.material-theme"
