tap "anomalyco/tap"
tap "cloudfoundry/tap"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "haiperspace/hai", "https://github.tools.sap/hAIperspace/hai-homebrew"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "modem-dev/tap"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sap/sapmachine"
brew "apfel"
brew "automake"
brew "xz"
brew "openssl@3"
brew "awscli"
brew "bat"
brew "gettext"
brew "chruby"
brew "cmake"
brew "gmp"
brew "coreutils"
brew "curl"
brew "devspace"
brew "dos2unix"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "go"
brew "gofumpt"
brew "graphviz"
brew "helm"
brew "hey"
brew "htop"
brew "iproute2mac"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "libffi"
brew "libyaml"
brew "mise"
brew "n"
brew "neovim"
brew "netcat"
brew "ollama"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "poppler"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "ruby-install"
brew "sonar-scanner"
brew "starship"
brew "telnet"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "wireshark"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "modem-dev/tap/hunk", trusted: true
cask "1password"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "arc"
cask "balenaetcher"
cask "beyond-compare@4"
cask "bruno"
cask "claude"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "dbvisualizer"
cask "drawio"
cask "firefox"
cask "fork"
cask "github"
cask "google-chrome"
cask "homerow"
cask "insomnia"
cask "intellij-idea"
cask "kicad"
cask "lookaway"
cask "maccy"
cask "microsoft-edge"
cask "ngrok/ngrok/ngrok"
cask "obsidian"
cask "raspberry-pi-imager"
cask "raycast"
cask "sap/sapmachine/sapmachine17-jdk"
cask "sap/sapmachine/sapmachine21-jdk"
cask "sap/sapmachine/sapmachine23-jdk", args: { appdir: "/Applications" }
cask "slack"
cask "spotify"
cask "todoist-app"
cask "tomatobar"
cask "visual-studio-code"
cask "warp"
cask "wireshark-app"
vscode "akamud.vscode-theme-onedark"
vscode "alexkrechik.cucumberautocomplete"
vscode "andys8.jest-snippets"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "firsttris.vscode-jest-runner"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jebbs.plantuml"
vscode "jhodel.blue-phoenix"
vscode "llam4u.nerdtree"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ryu1kn.partial-diff"
vscode "saoudrizwan.claude-dev"
vscode "sapos.yeoman-ui"
vscode "saposs.app-studio-remote-access"
vscode "saposs.app-studio-toolkit"
vscode "sapse.developer-platform-extension"
vscode "sapse.sapdas-extension"
vscode "spadin.zmk-tools"
vscode "tamasfe.even-better-toml"
vscode "tobias-z.vscode-harpoon"
vscode "tompollak.lazygit-vscode"
vscode "tomrijndorp.find-it-faster"
vscode "tyriar.sort-lines"
vscode "undotree.undo-tree"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-manifest-yaml"
vscode "vspacecode.whichkey"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "zhuangtongfa.material-theme"
go "github.com/go-delve/delve/cmd/dlv"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/gopls"
go "github.com/jesseduffield/lazygit"
go "honnef.co/go/tools/cmd/staticcheck"
uv "qmk", with: ["pip"]
npm "@earendil-works/pi-coding-agent"
npm "@sap/generator-joule"
npm "@sap/joule-cli"
npm "@sap/sapdas-cli"
npm "@usebruno/cli"
npm "corepack"
npm "developer-platform-extension-cli"
npm "sapdas-extension"
npm "typescript"
