tap "cloudfoundry/tap"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sap/sapmachine"
brew "gettext"
brew "cmake"
brew "devspace"
brew "fzf"
brew "htop"
brew "lazygit"
brew "mise"
brew "neovim"
brew "netcat"
brew "nvm"
brew "pipx"
brew "pkg-config"
brew "pyenv"
brew "ripgrep"
brew "tree"
brew "wget"
brew "zsh"
brew "cloudfoundry/tap/cf-cli@8"
brew "derailed/k9s/k9s"
brew "qmk/qmk/qmk"
cask "1password"
cask "aerospace"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "arc"
cask "beyond-compare"
cask "dbeaver-community"
cask "firefox"
cask "google-chrome"
cask "insomnia"
cask "kicad"
cask "maccy"
cask "microsoft-edge"
cask "obsidian"
cask "postman"
cask "sapmachine17-jdk"
cask "slack"
cask "todoist"
cask "visual-studio-code"
cask "zoom"
vscode "andys8.jest-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "jhodel.blue-phoenix"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "tamasfe.even-better-toml"
vscode "tobias-z.vscode-harpoon"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
