tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "sap/sapmachine"
brew "cmake"
brew "gettext"
brew "lazygit"
brew "neovim"
brew "pkg-config"
brew "rtx"
brew "tree"
brew "wget"
brew "zsh"
brew "nvm"
brew "maven"
brew "sapmachine17-jdk"
brew "cloudfoundry/tap/cf-cli@7"
brew "microsoft-edge"
brew "docker"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "discord"
cask "arc"
cask "firefox"
cask "google-chrome"
cask "maccy"
cask "insomnia"
cask "todoist"
cask "visual-studio-code"
cask "zoom"
cask "1password"
cask "obsidian"
cask "karabiner-elements"
cask "dbeaver-community"
cask "slack"
cask "beyond-compare"