tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "cmake"
brew "gettext"
brew "neovim"
brew "pkg-config"
brew "rtx"
brew "tree"
brew "wget"
cask "alfred"
cask "appcleaner"
cask "azure-data-studio"
cask "discord"
cask "firefox"
cask "iterm2"
cask "karabiner-elements"
cask "maccy"
cask "postman"
cask "qmk-toolbox"
cask "signal"
cask "todoist"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "Gruntfuggly.todo-tree"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeffjorczak.auto-translate-json"
vscode "mathematic.vscode-latex"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "ronaldosena.arduino-snippets"
vscode "rust-lang.rust-analyzer"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "zhuangtongfa.material-theme"
